# Dataset Cleaninig of Data Science Job Posting on Glassdoor

## Web scrapped job posts from glassdoor for data science jobs

### 0. Import necessary libraries:

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

### 1. Load and explore the data:

In [2]:
path_to_data = "Path/To/Your/Raw_DS_jobs.csv"
data = pd.read_csv(path_to_data)

print('Shape: ', data.shape)
print('Columns:', data.columns)
data.head()

Shape:  (672, 15)
Columns: Index(['index', 'Job Title', 'Salary Estimate', 'Job Description', 'Rating',
       'Company Name', 'Location', 'Headquarters', 'Size', 'Founded',
       'Type of ownership', 'Industry', 'Sector', 'Revenue', 'Competitors'],
      dtype='object')

,index,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,Type of ownership,Industry,Sector,Revenue,Competitors
0,0,Sr Data Scientist,$137K-$171K (Glassdoor est.),Description\n\nThe Senior Data Scientist is re...,3.1,Healthfirst\n3.1,"New York, NY","New York, NY",1001 to 5000 employees,1993,Nonprofit Organization,Insurance Carriers,Insurance,Unknown / Non-Applicable,"EmblemHealth, UnitedHealth Group, Aetna"
1,1,Data Scientist,$137K-$171K (Glassdoor est.),"Secure our Nation, Ignite your Future\n\nJoin ...",4.2,ManTech\n4.2,"Chantilly, VA","Herndon, VA",5001 to 10000 employees,1968,Company - Public,Research & Development,Business Services,$1 to $2 billion (USD),-1
2,2,Data Scientist,$137K-$171K (Glassdoor est.),Overview\n\n\nAnalysis Group is one of the lar...,3.8,Analysis Group\n3.8,"Boston, MA","Boston, MA",1001 to 5000 employees,1981,Private Practice / Firm,Consulting,Business Services,$100 to $500 million (USD),-1
3,3,Data Scientist,$137K-$171K (Glassdoor est.),JOB DESCRIPTION:\n\nDo you have a passion for ...,3.5,INFICON\n3.5,"Newton, MA","Bad Ragaz, Switzerland",501 to 1000 employees,2000,Company - Public,Electrical & Electronic Manufacturing,Manufacturing,$100 to $500 million (USD),"MKS Instruments, Pfeiffer Vacuum, Agilent Tech..."
4,4,Data Scientist,$137K-$171K (Glassdoor est.),Data Scientist\nAffinity Solutions / Marketing...,2.9,Affinity Solutions\n2.9,"New York, NY","New York, NY",51 to 200 employees,1998,Company - Private,Advertising & Marketing,Business Services,Unknown / Non-Applicable,"Commerce Signals, Cardlytics, Yodlee"

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 672 entries, 0 to 671
Data columns (total 15 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   index              672 non-null    int64
 1   Job Title          672 non-null    object
 2   Salary Estimate    672 non-null    object
 3   Job Description    672 non-null    object
 4   Rating             672 non-null    float64
 5   Company Name       672 non-null    object
 6   Location           672 non-null    object
 7   Headquarters       672 non-null    object
 8   Size               672 non-null    object
 9   Founded            672 non-null    int64
 10  Type of ownership  672 non-null    object
 11  Industry           672 non-null    object
 12  Sector             672 non-null    object
 13  Revenue            672 non-null    object
 14  Competitors        672 non-null    object
dtypes: float64(1), int64(2), object(12)
memory usage: 78.9+ KB

### 2. Check for duplicates:

In [4]:
print('Duplicates: ', data.duplicated().sum())
if data.duplicated().sum() > 0:
    data.drop_duplicates(inplace=True)
    print('Removed Duplicates Successfully.')

print('Duplicates: ', data.duplicated().sum())

Duplicates:  0
Duplicates:  0

### 3. Check for missing values:

In [5]:
data.isna().sum()

index                0
Job Title            0
Salary Estimate      0
Job Description      0
Rating               0
Company Name         0
Location             0
Headquarters         0
Size                 0
Founded              0
Type of ownership    0
Industry             0
Sector               0
Revenue              0
Competitors          0
dtype: int64

### 4. Make the Salary column into integers:

In [6]:
print('Current Data Type of Salary: ', type(data['Salary Estimate'][0]))
data['Salary Estimate']

Current Data Type of Salary:  <class 'str'>

0      $137K-$171K (Glassdoor est.)
1      $137K-$171K (Glassdoor est.)
2      $137K-$171K (Glassdoor est.)
3      $137K-$171K (Glassdoor est.)
4      $137K-$171K (Glassdoor est.)
                   ...
667    $105K-$167K (Glassdoor est.)
668    $105K-$167K (Glassdoor est.)
669    $105K-$167K (Glassdoor est.)
670    $105K-$167K (Glassdoor est.)
671    $105K-$167K (Glassdoor est.)
Name: Salary Estimate, Length: 672, dtype: object

In [7]:
# remove text from column, 
# split numbers into two columns, 
    # remove $ sign,
    # replace K by proper number (*1000),  
    # convert number to integer
# merge two columns in one column as a dictionary of ranges oder so

In [8]:
data['Salary Estimate'] = data['Salary Estimate'].replace(r'\(.*\)', '', regex=True)

In [9]:
data['Salary Estimate']

0      $137K-$171K
1      $137K-$171K
2      $137K-$171K
3      $137K-$171K
4      $137K-$171K
           ...
667    $105K-$167K
668    $105K-$167K
669    $105K-$167K
670    $105K-$167K
671    $105K-$167K
Name: Salary Estimate, Length: 672, dtype: object

In [10]:
data[['Salary Min', 'Salary Max']] = data['Salary Estimate'].str.split('-', expand=True)

In [11]:
data[['Salary Min', 'Salary Max']]

    Salary Min Salary Max
0        $137K     $171K
1        $137K     $171K
2        $137K     $171K
3        $137K     $171K
4        $137K     $171K
..         ...        ...
667      $105K     $167K
668      $105K     $167K
669      $105K     $167K
670      $105K     $167K
671      $105K     $167K

[672 rows x 2 columns]

In [12]:
def transform_salary(value):
    
    if isinstance(value, str):
        value = int(value.replace('$', '').replace('K', '')) * 1000
    
    return value

In [13]:
data['Salary Min'] = data['Salary Min'].apply(transform_salary)
data['Salary Max'] = data['Salary Max'].apply(transform_salary)

In [14]:
data[['Salary Min', 'Salary Max']]

     Salary Min  Salary Max
0        137000      171000
1        137000      171000
2        137000      171000
3        137000      171000
4        137000      171000
..          ...         ...
667      105000      167000
668      105000      167000
669      105000      167000
670      105000      167000
671      105000      167000

[672 rows x 2 columns]

In [15]:
data["Average Salary"] = (data["Salary Max"] + data["Salary Min"]) //2

In [16]:
data['Average Salary']

0      154000
1      154000
2      154000
3      154000
4      154000
        ...
667    136000
668    136000
669    136000
670    136000
671    136000
Name: Average Salary, Length: 672, dtype: int64

In [17]:
data['Salary Range'] = data['Salary Min'].astype(str) + '-' + data['Salary Max'].astype(str)

In [18]:
data['Salary Range']

0      137000-171000
1      137000-171000
2      137000-171000
3      137000-171000
4      137000-171000
           ...
667    105000-167000
668    105000-167000
669    105000-167000
670    105000-167000
671    105000-167000
Name: Salary Range, Length: 672, dtype: object

### 5. Remove numbers from Company Name

In [19]:
data['Company Name']

0               Healthfirst\n3.1
1                   ManTech\n4.2
2            Analysis Group\n3.8
3                   INFICON\n3.5
4        Affinity Solutions\n2.9
                 ...
667                TRANZACT\n3.6
668                         JKGT
669                   AccessHope
670    ChaTeck Incorporated\n5.0
671           1-800-Flowers\n2.7
Name: Company Name, Length: 672, dtype: object

In [20]:
data['Company Name'] = data['Company Name'].str.replace(r'\n\d+(\.\d+)?', '', regex=True)

In [21]:
data['Company Name']

0               Healthfirst
1                   ManTech
2            Analysis Group
3                   INFICON
4        Affinity Solutions
               ...
667                TRANZACT
668                    JKGT
669              AccessHope
670    ChaTeck Incorporated
671           1-800-Flowers
Name: Company Name, Length: 672, dtype: object

### 6. Create new feature: State column from Location column:

In [22]:
data['Location']

0           New York, NY
1          Chantilly, VA
2             Boston, MA
3             Newton, MA
4           New York, NY
             ...
667         Fort Lee, NJ
668    San Francisco, CA
669        Irwindale, CA
670    San Francisco, CA
671         New York, NY
Name: Location, Length: 672, dtype: object

In [23]:
data[['City', 'State Code']] = data['Location'].str.split(', ', expand=True, n=1)

In [24]:
data[['City', 'State Code']]

              City State Code
0         New York         NY
1        Chantilly         VA
2           Boston         MA
3           Newton         MA
4         New York         NY
..             ...        ...
667       Fort Lee         NJ
668  San Francisco         CA
669      Irwindale         CA
670  San Francisco         CA
671       New York         NY

[672 rows x 2 columns]

In [25]:
data.columns

Index(['index', 'Job Title', 'Salary Estimate', 'Job Description', 'Rating',
       'Company Name', 'Location', 'Headquarters', 'Size', 'Founded',
       'Type of ownership', 'Industry', 'Sector', 'Revenue', 'Competitors',
       'Salary Min', 'Salary Max', 'Average Salary', 'Salary Range', 'City',
       'State Code'],
      dtype='object')

### 7. Drop unnecessary columns:

In [26]:
columns_to_drop = ['index', 'Salary Estimate', 'Location', 'Founded']

data.drop(columns_to_drop, axis=1, inplace=True)

In [27]:
data.columns

Index(['Job Title', 'Job Description', 'Rating', 'Company Name',
       'Headquarters', 'Size', 'Type of ownership', 'Industry', 'Sector',
       'Revenue', 'Competitors', 'Salary Min', 'Salary Max', 'Average Salary',
       'Salary Range', 'City', 'State Code'],
      dtype='object')

### 8. Fix naming convention:

In [28]:
# Change the columns to a snake based format
data.rename(columns= lambda header: header.lower().replace(" ","_"), inplace= True)

In [29]:
data.columns

Index(['job_title', 'job_description', 'rating', 'company_name',
       'headquarters', 'size', 'type_of_ownership', 'industry', 'sector',
       'revenue', 'competitors', 'salary_min', 'salary_max', 'average_salary',
       'salary_range', 'city', 'state_code'],
      dtype='object')

### 9. Check the '-1' entries in the competitors column:

In [30]:
data.loc[data["competitors"] == "-1","competitors"].value_counts()

competitors
-1    501
Name: count, dtype: int64

In [31]:
## we can see that, there are 501 rows with the value of '-1' out of 672.
## It is better to drop this column since it has no informative or useful content

In [32]:
data.drop("competitors", axis=1, inplace=True)

In [33]:
data.columns

Index(['job_title', 'job_description', 'rating', 'company_name',
       'headquarters', 'size', 'type_of_ownership', 'industry', 'sector',
       'revenue', 'salary_min', 'salary_max', 'average_salary', 'salary_range',
       'city', 'state_code'],
      dtype='object')

In [34]:
data

,job_title,job_description,rating,company_name,headquarters,size,type_of_ownership,industry,sector,revenue,salary_min,salary_max,average_salary,salary_range,city,state_code
0,Sr Data Scientist,Description\n\nThe Senior Data Scientist is re...,3.1,Healthfirst,"New York, NY",1001 to 5000 employees,Nonprofit Organization,Insurance Carriers,Insurance,Unknown / Non-Applicable,137000,171000,154000,137000-171000,New York,NY
1,Data Scientist,"Secure our Nation, Ignite your Future\n\nJoin ...",4.2,ManTech,"Herndon, VA",5001 to 10000 employees,Company - Public,Research & Development,Business Services,$1 to $2 billion (USD),137000,171000,154000,137000-171000,Chantilly,VA
2,Data Scientist,Overview\n\n\nAnalysis Group is one of the lar...,3.8,Analysis Group,"Boston, MA",1001 to 5000 employees,Private Practice / Firm,Consulting,Business Services,$100 to $500 million (USD),137000,171000,154000,137000-171000,Boston,MA
3,Data Scientist,JOB DESCRIPTION:\n\nDo you have a passion for ...,3.5,INFICON,"Bad Ragaz, Switzerland",501 to 1000 employees,Company - Public,Electrical & Electronic Manufacturing,Manufacturing,$100 to $500 million (USD),137000,171000,154000,137000-171000,Newton,MA
4,Data Scientist,Data Scientist\nAffinity Solutions / Marketing...,2.9,Affinity Solutions,"New York, NY",51 to 200 employees,Company - Private,Advertising & Marketing,Business Services,Unknown / Non-Applicable,137000,171000,154000,137000-171000,New York,NY
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
667,Data Scientist,Summary\n\nWe’re looking for a data scientist ...,3.6,TRANZACT,"Fort Lee, NJ",1001 to 5000 employees,Company - Private,Advertising & Marketing,Business Services,Unknown / Non-Applicable,105000,167000,136000,105000-167000,Fort Lee,NJ
668,Data Scientist,Job Description\nBecome a thought leader withi...,-1.0,JKGT,-1,-1,-1,-1,-1,-1,105000,167000,136000,105000-167000,San Francisco,CA
669,Data Scientist,Join a thriving company that is changing the w...,-1.0,AccessHope,-1,-1,-1,-1,-1,-1,105000,167000,136000,105000-167000,Irwindale,CA
670,Data Scientist,100 Remote Opportunity As an AINLP Data Scient...,5.0,ChaTeck Incorporated,"Santa Clara, CA",1 to 50 employees,Company - Private,Advertising & Marketing,Business Services,$1 to $5 million (USD),105000,167000,136000,105000-167000,San Francisco,CA
671,Data Scientist,Description\n\nThe Data Scientist will be part...,2.7,1-800-Flowers,"Carle Place, NY",1001 to 5000 employees,Company - Public,Wholesale,Business Services,$1 to $2 billion (USD),105000,167000,136000,105000-167000,New York,NY

### 10. In the 'headquarters' column, Replace '-1' by 'Unknown'

In [35]:
data.loc[:,'headquarters'] = data.loc[:,'headquarters'].str.replace('-1', 'Unknown')

### 11. In the 'size' column, Replace '-1' by 'Unknown'

In [36]:
data.loc[:,'size'] = data.loc[:,'size'].str.replace('-1', 'Unknown')

### 12. In the 'type_of_ownership' column, Replace '-1' by 'Unknown', Remove prefix 'Company -', Remove suffix 'Orgnaization'

In [37]:
data.loc[:,'type_of_ownership'] = data.loc[:,'type_of_ownership'].str.replace('-1', 'Unknown')
data.loc[:,'type_of_ownership'] = data.loc[:,'type_of_ownership'].str.replace('Company -', '').str.replace('Organization', '')

### 13. In the 'industry' column, Replace '-1' by 'Unknown'

In [38]:
data.loc[:,'industry'] = data.loc[:,'industry'].str.replace('-1', 'Unknown')

### 14. In the 'sector' column, Replace '-1' by 'Unknown'

In [39]:
data.loc[:,'sector'] = data.loc[:,'sector'].str.replace('-1', 'Unknown')

### 15. In the 'revenue' column, Replace '-1' by 'Unknown'

In [40]:
data.loc[:,'revenue'] = data.loc[:,'revenue'].str.replace('-1', 'Unknown')

### 16. Check if there is any '-1' still undeleted:

In [41]:
data[data.eq("-1").any(axis = 1)]

Empty DataFrame
Columns: [job_title, job_description, rating, company_name, headquarters, size, type_of_ownership, industry, sector, revenue, salary_min, salary_max, average_salary, salary_range, city, state_code]
Index: []

### 17. Organize the 'job_title' column:

In [42]:
def title_simplification(title):
    if "data scientist" in title.lower():
        return "data scientist"
    elif "data analyst" in title.lower():
        return "data analyst"
    elif "data engineer" in title.lower():
        return "data engineer"
    elif "machine learning" in title.lower():
        return "machine learning"
    elif "analyst" in title.lower():
        return "data analyst"
    else:
        return "n/a"

data["job_title"]= data["job_title"].apply(title_simplification)
data["job_title"].value_counts()

job_title
data scientist      455
n/a                  79
data analyst         55
data engineer        47
machine learning     36
Name: count, dtype: int64

### 19. Visualize final state:

In [43]:
data

,job_title,job_description,rating,company_name,headquarters,size,type_of_ownership,industry,sector,revenue,salary_min,salary_max,average_salary,salary_range,city,state_code
0,data scientist,Description\n\nThe Senior Data Scientist is re...,3.1,Healthfirst,"New York, NY",1001 to 5000 employees,Nonprofit,Insurance Carriers,Insurance,Unknown / Non-Applicable,137000,171000,154000,137000-171000,New York,NY
1,data scientist,"Secure our Nation, Ignite your Future\n\nJoin ...",4.2,ManTech,"Herndon, VA",5001 to 10000 employees,Public,Research & Development,Business Services,$1 to $2 billion (USD),137000,171000,154000,137000-171000,Chantilly,VA
2,data scientist,Overview\n\n\nAnalysis Group is one of the lar...,3.8,Analysis Group,"Boston, MA",1001 to 5000 employees,Private Practice / Firm,Consulting,Business Services,$100 to $500 million (USD),137000,171000,154000,137000-171000,Boston,MA
3,data scientist,JOB DESCRIPTION:\n\nDo you have a passion for ...,3.5,INFICON,"Bad Ragaz, Switzerland",501 to 1000 employees,Public,Electrical & Electronic Manufacturing,Manufacturing,$100 to $500 million (USD),137000,171000,154000,137000-171000,Newton,MA
4,data scientist,Data Scientist\nAffinity Solutions / Marketing...,2.9,Affinity Solutions,"New York, NY",51 to 200 employees,Private,Advertising & Marketing,Business Services,Unknown / Non-Applicable,137000,171000,154000,137000-171000,New York,NY
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
667,data scientist,Summary\n\nWe’re looking for a data scientist ...,3.6,TRANZACT,"Fort Lee, NJ",1001 to 5000 employees,Private,Advertising & Marketing,Business Services,Unknown / Non-Applicable,105000,167000,136000,105000-167000,Fort Lee,NJ
668,data scientist,Job Description\nBecome a thought leader withi...,-1.0,JKGT,Unknown,Unknown,Unknown,Unknown,Unknown,Unknown,105000,167000,136000,105000-167000,San Francisco,CA
669,data scientist,Join a thriving company that is changing the w...,-1.0,AccessHope,Unknown,Unknown,Unknown,Unknown,Unknown,Unknown,105000,167000,136000,105000-167000,Irwindale,CA
670,data scientist,100 Remote Opportunity As an AINLP Data Scient...,5.0,ChaTeck Incorporated,"Santa Clara, CA",1 to 50 employees,Private,Advertising & Marketing,Business Services,$1 to $5 million (USD),105000,167000,136000,105000-167000,San Francisco,CA
671,data scientist,Description\n\nThe Data Scientist will be part...,2.7,1-800-Flowers,"Carle Place, NY",1001 to 5000 employees,Public,Wholesale,Business Services,$1 to $2 billion (USD),105000,167000,136000,105000-167000,New York,NY

### 20. Export final state of the data into a target .CSV file

In [44]:
target_path = "Path/To/Your/Cleaned_DS_jobs.csv"
data.to_csv(target_path, index=False)